---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExtrusionAnalyzer
source: html/93ecfc6f-7b46-490f-bf42-24efd3ef9017.htm
---
# ExtrusionAnalyzer Members

Calculates the alignment status of each face of the solid.